In [1]:
import pandas as pd
import numpy as np
import re
import sys

In [2]:
# Load Databases
fd = 'D:\Descargas\Proyecto Final\Resources'
appearances = f'{fd}/appearances.csv'
clubs = f'{fd}/clubs.csv'
competitions = f'{fd}/competitions.csv' # Exclude this for our database
games = f'{fd}/games.csv'
players = f'{fd}/players.csv'
top250 = f'{fd}/top250.csv'

In [3]:
# Creating pandas dataframes
appearances_df = pd.read_csv(appearances)
clubs_df = pd.read_csv(clubs)
games_df = pd.read_csv(games)
players_df = pd.read_csv(players)
top250_df = pd.read_csv(top250)

## Dropping columns from original Datasets

In [4]:
# Mantaining columns in appereances df
appearances_df = appearances_df[['player_id', 'appearance_id', 'game_id', 'goals', 'assists', \
'minutes_played', 'yellow_cards', 'red_cards']]
appearances_df.head()

,player_id,appearance_id,game_id,goals,assists,minutes_played,yellow_cards,red_cards
0,410184,2602706_410184,2602706,0,0,45,0,0
1,84938,2581152_84938,2581152,0,0,90,0,0
2,84938,2581178_84938,2581178,0,0,90,0,0
3,84938,2581188_84938,2581188,0,0,90,0,0
4,84938,2581196_84938,2581196,0,0,90,0,0

In [5]:
# Mantaining columns ins games df
games_df = games_df[['game_id', 'season']]
games_df.head()

   game_id  season
0  2581147    2015
1  2576512    2015
2  2581181    2015
3  2581179    2015
4  2581178    2015

In [6]:
# Mantaining columns in clubs df
clubs_df = clubs_df[['club_id', 'pretty_name', 'total_market_value']]
clubs_df.rename(columns={"pretty_name": "club_name",
                        'total_market_value': 'club_market_value'}, inplace=True)
clubs_df.head()

   club_id                      club_name  club_market_value
0     6996               Goverla Uzhgorod                NaN
1     6994  Metalurg Zaporizhya Bis 2016                 NaN
2     7185          Panthrakikos Komotini               23.0
3     3216              Mersin Idmanyurdu                NaN
4    28956                    Ael Kalloni                NaN

In [7]:
# Mantaining columns in players df
players_df = players_df[['player_id', 'pretty_name', 'current_club_id', 'country_of_birth', \
                         'country_of_citizenship', 'position']]
players_df.rename(columns={"pretty_name": "player_name",
                          "current_club_id": "club_id",
                          "position": "player_position"}, inplace=True)
players_df.head()

,player_id,player_name,club_id,country_of_birth,country_of_citizenship,player_position
0,257767,Aloy Ihenacho,4795,Nigeria,Nigeria,Attack
1,320889,Thomas Blomeyer,4795,Germany,Germany,Defender
2,42318,Konstantin Engel,4795,UdSSR,Kazakhstan,Defender
3,94598,Stefan Wannenwetsch,4795,Germany,Germany,Midfield
4,381921,Ivan Komlev,6994,NaN,Ukraine,Defender

## Formatting columns from Top250 dataset
#### Changing format string "2017-2018" to int 2017

In [8]:
# Changing date format of top250 df
p= r'(^[0-9]{4})'
season = top250_df.Season.str.findall(p).tolist()
year = []
for date in season:
    year.append(int(date[0]))
    
top250_df['Season'] = year

In [9]:
# Renaming columns 
top250_df = top250_df[['Name', 'Transfer_fee', 'Age', 'Team_from', 'League_from', 'Team_to', \
                      'Market_value', 'Season']]
top250_df.rename(columns={"Name": "player_name",
                         "Transfer_fee": "transfer_fee",
                         "Age": "age",
                         "Team_from": "team_from",
                         "League_from": "league_from",
                         "Team_to": "team_to",
                         "Market_value": "market_value",
                         "Season": "season"}, inplace=True)
top250_df.head()

,player_name,transfer_fee,age,team_from,league_from,team_to,market_value,season
0,Luís Figo,60000000,27,FC Barcelona,LaLiga,Real Madrid,NaN,2000
1,Hernán Crespo,56810000,25,Parma,Serie A,Lazio,NaN,2000
2,Marc Overmars,40000000,27,Arsenal,Premier League,FC Barcelona,NaN,2000
3,Gabriel Batistuta,36150000,31,Fiorentina,Serie A,AS Roma,NaN,2000
4,Nicolas Anelka,34500000,21,Real Madrid,LaLiga,Paris SG,NaN,2000

## Dropping NaN values

In [10]:
# Dropping NaN values
appearances_df = appearances_df.dropna()
clubs_df = clubs_df.dropna()
games_df = games_df.dropna()
players_df = players_df.dropna()
top250_df = top250_df.dropna()

## Looking at variable types per DataSets
#### Reescaling club market value to millions

In [11]:
# Reescaling club market value
clubs_df.club_market_value = clubs_df["club_market_value"] * 1000000
clubs_df["club_market_value"] = clubs_df.club_market_value.astype(int)
clubs_df.head()

    club_id              club_name  club_market_value
2      7185  Panthrakikos Komotini           23000000
6       825          Eskisehirspor            1550000
8      3558            Gfc Ajaccio          450000000
11     2990      Academica Coimbra            3490000
13      641       Fc Middlesbrough           36360000

In [12]:
# Variable types in clubs_df
clubs_df.dtypes

club_id               int64
club_name            object
club_market_value     int32
dtype: object

In [12]:
# Variable types in appearances_df
appearances_df.dtypes

player_id          int64
appearance_id     object
game_id            int64
goals              int64
assists            int64
minutes_played     int64
yellow_cards       int64
red_cards          int64
dtype: object

In [13]:
# Variable types in games_df
games_df.dtypes

game_id    int64
season     int64
dtype: object

In [15]:
# Variable types in players_df
players_df.dtypes

player_id                  int64
player_name               object
club_id                    int64
country_of_birth          object
country_of_citizenship    object
player_position           object
dtype: object

In [14]:
# Variable types in top250_df
top250_df.dtypes

player_name      object
transfer_fee      int64
age               int64
team_from        object
league_from      object
team_to          object
market_value    float64
season            int64
dtype: object

## Connecting to SQL DataBase

In [17]:
from sqlalchemy import create_engine
import psycopg2

In [15]:
## LOAD
# Store environmental variable
from getpass import getpass
password = getpass('Enter database password')
# Configure settings for RDS
mode = "append"
db_string = f"postgresql://postgres:{password}@127.0.0.1:5432/Football_DB" 
config = {"user":"postgres",
          "password": password,
          "driver":"org.postgresql.Driver"}

Enter database password········

In [16]:
from sqlalchemy import create_engine

engine = create_engine(db_string)

In [19]:
# Load clubs df data
clubs_df.to_sql(name="clubs", con=engine, if_exists="replace", index=False)

In [20]:
# Load appearances df data
appearances_df.to_sql(name="appearances", con=engine, if_exists="replace", index=False)

In [21]:
# Load games df data
games_df.to_sql(name="games", con=engine, if_exists="replace", index=False)

In [22]:
# Load players df data
players_df.to_sql(name="players", con=engine, if_exists="replace", index=False)

In [23]:
# Load top250 df data
top250_df.to_sql(name="top250", con=engine, if_exists="replace", index=False)